# Завдання 4.
# Користувач вводить натуральне число. Потрібно визначити, чи є рік із цим числом високосним.
# Якщо рік є високосним, то виведіть `YES`, інакше виведіть `NO`.
# Примітка: відповідно до григоріанського календаря, рік є високосним, якщо його номер кратний 4,
# але не кратний 100, а також якщо він кратний 400.

def year(number):
    return number % 4 == 0 or number % 400 == 0 and number % 100 != 0


a = int(input('Введить рік: '))


if year(a):
    print('YES')
else:
    print('No')
