# Завдання 6.
# Створити рекурсивну функцію, що приймає натуральне число і повертає число з послідовності Фібоначі,
# позиція якого відповідає введеному числу.
# Кожне наступне число послідовности Фібоначі -- це сума двох попередніх чисел. Тобто:
# 0 1 1 2 3 5 8 13 21 34 55 89 і т.д.
# Отже, якщо в функцію передадуть число 5, то вона має повернути 5те число з послідовности, тобто 3.
# Якщо введуть 10, то має повернути 10те число, тобто 34.
# Розрахувати за допомогою цієї функції та вивести на екран 20те число з послідовності Фібоначі.


def fibonachi(number):
    if number <= 1:
        return 0
    elif number == 2:
        return 1
    else:
        return fibonachi(number - 1) + fibonachi(number - 2)


number_1 = int(input('Введить натуральне число: '))
if number_1 < 0:
    number_1 = int(input('Введить натуральне число: '))

res = fibonachi(number_1)

print('Відповідне число з послідовності Фібоначчі:', res)

print('20-те число з послідовності Фібоначі:', fibonachi(20))



