"""Завдання №2
Користувач вводить довжини катетів прямокутного трикутника.
Написати функцію, яка обчислить площу та периметр цього трикутника. Функція має повертати пару значень."""


def triangle_square_and_perimeter(a, b):
    square = round(((a * b) / 2), 3)
    perimeter = round(((a ** 2 + b ** 2) ** 0.5 + a + b), 3)
    return square, perimeter


k1 = float(input('Введить довжину першого катета: '))
k2 = float(input('Введить довжину другого катета: '))

res = triangle_square_and_perimeter(k1, k2)

print('Площа прямокутного трикутника:', res[0])
print('Периметр прямокутного трикутника:', res[1])
