"""Завдання №5"""

str_num = input('Введить рядок: ')
if len(str_num) < 5:
    str_num = input('Введить рядок не менш, ніж п\'ять символів: ')

# виведіть третій символ цього рядка
print('Третій символ рядка:', str_num[2])

# виведіть передостанній символ цього рядка
print('Передостанній символ рядка:', str_num[-2])

# виведіть перші п'ять символів цього рядка
print('Перші п\'ять символів рядка:', str_num[0:5])

# виведіть весь рядок, крім двох останніх символів
print('Рядок, крім останніх двох символів:', str_num[:-2])

# виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0,
# тому символи виводяться починаючи з першого)
print('Символи з парними індексами:', str_num[0::2])

# виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка
print('Символи з непарними індексами:', str_num[1::2])

# виведіть усі символи у зворотному порядку
print('Символи у зворотньому порядку:', str_num[::-1])

# виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього
print('Символи рядка через один у зворотньому порядку, починаючи з останнього:', str_num[::-2])

# виведіть довжину цього рядка
print('Довжина рядка:', len(str_num))
