# Завдання 7.
# Користувач вводить трьохзначне число. Напишіть функцію, що розраховує суму усіх цифр цього числа.
# Не можна використовувати int(), float(), Decimal() або будь-яке інше явне чи неявне приведення рядку до числа.
# Підказка: дивіться таблицю ASCII, зверніть увагу на коди символів, згадайте, як їх дістати, маючи один символ.

number_3 = input('Введить трьохзначне число: ')


def sum_num_ord(number):
    num_ord_1 = ord(number[0]) - ord('0')
    num_ord_2 = ord(number[1]) - ord('0')
    num_ord_3 = ord(number[2]) - ord('0')
    return num_ord_1 + num_ord_2 + num_ord_3


print(sum_num_ord(number_3))
