# Поміняти місцями значення змінних a та b для наступних випадків:
# c) Типи значень в змінних a та b можуть бути лише цілими числами.
# Поміняйте значення змінних використовуючи лише арифметичні операції '+' та '-'
# Не можна використовувати списків, рядків, інших колекцій. В файлі має бути не більше трьох змінних a, b та c.

a = int(input('Введите переменную а: '))
b = int(input('Введите переменную b: '))
a = a + b
b = a - b
a = a - b
print('Переменная а после замеы:', a)
print('Переменная b после замены:', b)