# Завдання 1_с.
# Поміняти місцями значення змінних a та b для наступних випадків:
# c) Типи значень в змінних a та b можуть бути лише цілими числами.
# Поміняйте значення змінних використовуючи лише арифметичні операції '+' та '-'
# Не можна використовувати списків, рядків, інших колекцій. В файлі має бути не більше трьох змінних a, b та c.

a = int(input('Введить змінну а: '))
b = int(input('Введить змінну b: '))
a = a + b
b = a - b
a = a - b
print('Змінна а після заміни:', a)
print('Змінна b після заміни:', b)