""" Завдання 5.
Згідно з древньою індійською легендою творець гри в шахи за свій винахід попросив у раджі незначну
на перший погляд винагороду: стільки пшеничних зерен, скільки опиниться на шаховій дошці,
якщо на першу клітинку покласти одне зерно, на другу -- два зерна, на третю -- чотири, і т.д..
Виявилося, що такої кількості зерна немає на усій планеті (2**64-1 зерен).
Напишіть програму, що вираховує починаючи з якої клітинки дошки раджі треба було віддати Nкг зерна,
де N -- вводить користувач. Прийняти вагу однієї зернинки за 35мг.
Номер клітинки виводити в букво-циферних традиційних шахових координатах. Наприклад:

kilograms = 0.03584  # 35mg per seed, 1024 seeds
calculate_wheat_chess_position(kilograms)  # prints 'b3'
"""

# 18446744073709550615 зерен на последней клетке
# 645636042579834.271525 кг - примерный вес этого количества зерен, если 1 зернышко весит 0.000035 кг


def calculate_wheat_chess_position(kilograms):
    quantity = kilograms / 0.000035
    x = None
    y = None
    result = 0

    for i in range(64):
        result += 2 ** i
        if result >= quantity:
            x = chr((i % 8 + 1) + 96)
            y = i // 8 + 1
            break
    return x, y


kilograms_1 = float(input('Введить кількість зерна, яку потрібно віддати у кг: '))
if kilograms_1 >= 645636042579834.271525:
    kilograms_1 = float(input('Кількість зерна завелика! Введить кількість зерна, яку потрібно віддати у кг: '))


res = calculate_wheat_chess_position(kilograms_1)
print('Координати клітинки:', res[0] + str(res[1]))
