""" Завдання 7.
Програма випадковим чином обирає число від 1 до 10 і пропонує користувачу його вгадати.
Користувач вводить число, а програма перевіряє його і, якщо користувач не вгадав,
що повідомляє ви введене число більше чи менше від згенерованого. Після цього знову просить вгадати.
І так, поки користувач не вгадає.
"""
from random import randint

number = randint(1, 10)
print(number)     # print загадане число для перевірки результату
print('Гра вгадай число від 1 до 10!')
number_user = 0

while number_user != number:
    number_user = int(input('Введить число від 1 до 10: '))
    if number_user == number:
        print('Число вгадано вірно!', number)
        break
    if number_user < number:
        print('Введене число менше за загадане')
    elif number_user > number:
        print('Введене число більше за загадане')
